<?php
/**
 * MyBB 1.6 English Language Pack
 * Copyright 2010 MyBB Group, All Rights Reserved
 *
 * $Id: datahandler_user.lang.php 5016 2010-06-12 00:24:02Z RyanGordon $
 */

$l['postdata_invalid_user_id'] = "זיהוי המשתמש לא קיים. אנא ציין זיהוי משתמש חוקי.";
$l['postdata_firstpost_no_subject'] = "האשכול אינו מכיל כותרת. אנא רשום כותרת.";
$l['postdata_missing_subject'] = "הכותרת חסרה. אנא רשום כותרת.";
$l['postdata_missing_message'] = "ההודעה חסרה. אנא רשום הודעה.";
$l['postdata_message_too_long'] = "ההודעה ארוכה מדי. אנא רשום הודעה קטנה מ-{1} תווים (כרגע ההודעה שלך מכילה {2} תווים).";
$l['postdata_message_too_short'] = "ההודעה קצרה מדי. אנא כתוב הודעה ארוכה יותר מ{1} תווים.";
$l['postdata_post_flooding'] = "אתה מנסה לפרסם הודעה מהר מדי אחרי ההודעה הקודמת. אנא המתן עוד {1} שניות לפני שתוכל לפרסם שוב הודעה.";
$l['postdata_post_flooding_one_second'] = "אתה מנסה לפרסם הודעה מהר מדי אחרי ההודעה הקודמת. אנא המתן עוד שנייה אחת לפני שתוכל לפרסם שוב הודעה.";
$l['postdata_too_many_images'] = "ההודעה שכתבת מכילה {1} תמונות, אך ניתן להכניס רק {2} תמונות להודעה. אנא הסר תמונות מהודעתך על מנת שלא יעבור את הגבלת התמונות.";
$l['thread_closed'] = "אשכול נסגר";
$l['thread_opened'] = "אשכול נפתח";
$l['thread_stuck'] = "אשכול ננעץ";
$l['thread_unstuck'] = "אשכול לא ננעץ";
$l['userdata_missing_username'] = "לא כתבת שם משתמש. אנא בחר שם משתמש וכתוב אותו.";
$l['userdata_banned_username'] = "שם המשתמש שכתבת לא יכול להרשם. אנא רשום שם משתמש אחר.";
$l['userdata_bad_characters_username'] = "שם המשתמש שכתבת מכיל תווים לא חוקיים. אנא רשום שם משתמש אחר.";
$l['userdata_invalid_username_length'] = "שם המשתמש שכתבת הוא בעל אורך לא חוקי. אנא כתוב שם משתמש בין {1} ל-{2} תווים.";
$l['userdata_invalid_usertitle_length'] = "כותרת המשתמש שרשמת הוא בעל אורך לא חוקי. אנא כתוב כותרת שאינה ארוכה מ{1} תווים.";
$l['userdata_username_exists'] = "שם המשתמש שכתבת נמצא בשימוש כבר. אנא כתוב שם משתמש אחר.";
$l['userdata_invalid_password_length'] = "הסיסמא שכתבת היא בעל אורך לא חוקי. אנא כתוב סיסמא בין {1} ל-{2} תווים.";
$l['userdata_no_complex_characters'] = "הסיסמא שרשמת לא קשה מספיק. אנא הכנס סיסמא באורך 8 תוים לפחות, אשר כוללת אותיות גדולות,אותיות קטנות ומספרים.";
$l['userdata_passwords_dont_match'] = "הסיסמאות שרשמת אינן תואמות. אנא נסה שנית.";
$l['userdata_missing_email'] = "לא כתבת כתובת אימייל. אנא כתוב בבקשה.";
$l['userdata_invalid_email_format'] = "כתובת האימייל שהכנסת אינה חוקית. אנא הכנס אחת חוקית בבקשה.";
$l['userdata_emails_dont_match'] = "כתובות האמייל שרשמת אינן תואמות. אנא נסה שנית.";
$l['userdata_banned_email'] = "כתובת האימייל שרשמת אינה מותרת לשימוש כרגע. אנא רשום כתובת אימייל אחרת.";
$l['userdata_email_already_in_use'] = "כתובת האימייל שרשמת כבר נמצאת בשימוש. אנא הכנס כתובת אימייל אחרת.";
$l['userdata_dob_required'] = "לא הכנסת את תאריך יום ההולדת שלך. עליך להכניס תאריך יום הולדת בכדי להמשיך - באפשרותך להסתיר את תאריך יום ההולדת שלך או את גילך ממשתמשים אחרים.";
$l['userdata_invalid_website'] = "כתובת האתר שרשמת אינה חוקית. אנא רשום כתובת אתר חוקית או שתשאיר את השדה ריק.";
$l['userdata_invalid_icq_number'] = "מספר הICQ שרשמת אינו חוקי. אנא רשום מספר ICQ חוקי או השאר את השדה ריק.";
$l['userdata_invalid_msn_address'] = "כתובת הMSN שהכנסת אינה חוקית. אנא הכנס כתובת MSN חוקית או שתשאיר את השדה ריק.";
$l['userdata_invalid_birthday'] = "יום ההולדת שהכנסת אינה חוקית. אנא הכנס יום הולדת חוקי או שאתשאיר את האזור ריק.";
$l['userdata_invalid_birthday_coppa'] = "על מנת לאשר את גילך, אנא רשום את השנה בה נולדת. אתה יכול להסתיר את הגיל ותאריך יום ההולדת באפשרויות הפרופיל שלך.";
$l['userdata_invalid_birthday_coppa2'] = "אתה צריך להיות לפחות בן 13 על מנת להיות חבר בפורום זה. אנא דבר עם המנהל.";
$l['userdata_invalid_referrer'] = "המפנה שרשמת אינו קיים. אנא הכנס מפנה קיים או השאר את השדה ריק.";
$l['userdata_invalid_language'] = "השפה שרשמת אינה קיימתי. אנא הבחר שפה קיימת.";
$l['userdata_missing_returndate'] = "בתאריך החזרה שציינת חסר שדה או יותר. אנא תהיה בטוח שמילאת את כל השדות של היום, החודש והשנה.";
$l['userdata_missing_required_profile_field'] = "אתה לא בחרת באף אפשרות עבור השדה \"{1}\". אנא מלא או בחר אפשרות לשדה זה.";
$l['userdata_bad_profile_field_values'] = "לא בחרת אפשרות חוקית עבור השדה \"{1}\".אנא בחר ערך מהרשימה.";
$l['userdata_max_limit_reached'] = "הכנסת מספר לא חוקי של תוים בשדה  \"ה{1}\". אנא מלא את שדה זה עם לא יותר מאשר {2} תוים.";
$l['userdata_invalid_checkfield'] = "התגלה שטופס זה נשלח על ידי spam bot. אם זה טעות אנא דבר עם המנהל.";
$l['userdata_invalid_postnum'] = "כמות ההודעות שרשמת לא חוקית. אנא רשום כמות חוקית או השאר את השדה ריק.";
?>