<?php
/**
 * MyBB 1.6 English Language Pack
 * Copyright 2010 MyBB Group, All Rights Reserved
 * 
 * $Id: editpost.lang.php 5016 2010-06-12 00:24:02Z RyanGordon $
 */

$l['userdata_missing_username'] = "לא כתבת שם משתמש. אנא בחר שם משתמש וכתוב אותו.";
$l['userdata_banned_username'] = "שם המשתמש שכתבת לא יכול להרשם. אנא רשום שם משתמש אחר.";
$l['userdata_bad_characters_username'] = "שם המשתמש שכתבת מכיל תווים לא חוקיים. אנא רשום שם משתמש אחר.";
$l['userdata_invalid_username_length'] = "שם המשתמש שכתבת הוא בעל אורך לא חוקי. אנא כתוב שם משתמש בין {1} ל-{2} תווים.";
$l['userdata_invalid_usertitle_length'] = "כותרת המשתמש שרשמת הוא בעל אורך לא חוקי. אנא כתוב כותרת שאינה ארוכה מ{1} תווים.";
$l['userdata_username_exists'] = "שם המשתמש שכתבת נמצא בשימוש כבר. אנא כתוב שם משתמש אחר.";
$l['userdata_invalid_password_length'] = "הסיסמא שכתבת היא בעל אורך לא חוקי. אנא כתוב סיסמא בין {1} ל-{2} תווים.";
$l['userdata_no_complex_characters'] = "הסיסמא שרשמת לא קשה מספיק. אנא הכנס סיסמא באורך 8 תוים לפחות, אשר כוללת אותיות גדולות,אותיות קטנות ומספרים.";
$l['userdata_passwords_dont_match'] = "הסיסמאות שרשמת אינן תואמות. אנא נסה שנית.";
$l['userdata_missing_email'] = "לא כתבת כתובת אימייל. אנא כתוב בבקשה.";
$l['userdata_invalid_email_format'] = "כתובת האימייל שהכנסת אינה חוקית. אנא הכנס אחת חוקית בבקשה.";
$l['userdata_emails_dont_match'] = "כתובות האמייל שרשמת אינן תואמות. אנא נסה שנית.";
$l['userdata_banned_email'] = "כתובת האימייל שרשמת אינה מותרת לשימוש כרגע. אנא רשום כתובת אימייל אחרת.";
$l['userdata_email_already_in_use'] = "כתובת האימייל שרשמת כבר נמצאת בשימוש. אנא הכנס כתובת אימייל אחרת.";
$l['userdata_dob_required'] = "לא הכנסת את תאריך יום ההולדת שלך. עליך להכניס תאריך יום הולדת בכדי להמשיך - באפשרותך להסתיר את תאריך יום ההולדת שלך או את גילך ממשתמשים אחרים.";
$l['userdata_invalid_website'] = "כתובת האתר שרשמת אינה חוקית. אנא רשום כתובת אתר חוקית או שתשאיר את השדה ריק.";
$l['userdata_invalid_icq_number'] = "מספר הICQ שרשמת אינו חוקי. אנא רשום מספר ICQ חוקי או השאר את השדה ריק.";
$l['userdata_invalid_msn_address'] = "כתובת הMSN שהכנסת אינה חוקית. אנא הכנס כתובת MSN חוקית או שתשאיר את השדה ריק.";
$l['userdata_invalid_birthday'] = "יום ההולדת שהכנסת אינה חוקית. אנא הכנס יום הולדת חוקי או שאתשאיר את האזור ריק.";
$l['userdata_invalid_birthday_coppa'] = "על מנת לאשר את גילך, אנא רשום את השנה בה נולדת. אתה יכול להסתיר את הגיל ותאריך יום ההולדת באפשרויות הפרופיל שלך.";
$l['userdata_invalid_birthday_coppa2'] = "אתה צריך להיות לפחות בן 13 על מנת להיות חבר בפורום זה. אנא דבר עם המנהל.";
$l['userdata_invalid_referrer'] = "המפנה שרשמת אינו קיים. אנא הכנס מפנה קיים או השאר את השדה ריק.";
$l['userdata_invalid_language'] = "השפה שרשמת אינה קיימתי. אנא הבחר שפה קיימת.";
$l['userdata_missing_returndate'] = "בתאריך החזרה שציינת חסר שדה או יותר. אנא תהיה בטוח שמילאת את כל השדות של היום, החודש והשנה.";
$l['userdata_missing_required_profile_field'] = "אתה לא בחרת באף אפשרות עבור השדה \"{1}\". אנא מלא או בחר אפשרות לשדה זה.";
$l['userdata_bad_profile_field_values'] = "לא בחרת אפשרות חוקית עבור השדה \"{1}\".אנא בחר ערך מהרשימה.";
$l['userdata_max_limit_reached'] = "הכנסת מספר לא חוקי של תוים בשדה  \"ה{1}\". אנא מלא את שדה זה עם לא יותר מאשר {2} תוים.";
$l['userdata_invalid_checkfield'] = "התגלה שטופס זה נשלח על ידי spam bot. אם זה טעות אנא דבר עם המנהל.";
$l['userdata_invalid_postnum'] = "כמות ההודעות שרשמת לא חוקית. אנא רשום כמות חוקית או השאר את השדה ריק.";
$l['nav_editpost'] = "ערוך הודעה";
$l['edit_post'] = "ערוך הודעה זו";
$l['delete_post'] = "מחק הודעה";
$l['delete_q'] = "למחוק?";
$l['delete_1'] = "כדי למחוק הודעה זו, סמן את התיבה מימין ולחץ על הכפתור משמאל.";
$l['delete_2'] = "<b>הערה:</b> אם הודעה זו הינה ההודעה הראשונה באשכול,האשכול כולו יימחק.";
$l['subject'] = "כותרת";
$l['your_message'] = "ההודעה שלך";
$l['post_options'] = "אפשרויות הודעה:";
$l['options_sig'] = "<strong>חתימה:</strong> כלול את החתימה שלי. (משתמשים רשומים בלבד)";
$l['options_emailnotify'] = "<strong>התראת אמייל:</strong> קבל הודעת אמייל בכל פעם שיש תגובה חדשה. (משתמשים רשומים בלבד)";
$l['options_disablesmilies'] = "<strong>בטל סמיילים:</strong> בטל הצגת סמיילים בהודעה זו.";
$l['preview_post'] = "תצוגה מקדימה להודעה";
$l['update_post'] = "עדכן הודעה";
$l['poll'] = "סקר:";
$l['poll_desc'] = "באפשרותך להוסיף סקר לאשכול זה.";
$l['poll_check'] = "אני רוצה לפרסם סקר";
$l['num_options'] = "מספר אפשרויות:";
$l['max_options'] = "(מקסימום: {1})";
$l['delete_now'] = "מחק עכשיו";
$l['edit_time_limit'] = "מצטערים אך אתה לא יכול לערוך את הודעתך. מנהל הפורום בחר שתוכל לערוך את הודעתך עד {1} דקות לאחר הפרסום.";
$l['no_prefix'] = "ללא קידומת";
$l['redirect_nodelete'] = "הודעה לא נמחקה בגלל שלא סימנת את תיבת \"מחק\".";
$l['redirect_postedited'] = "תודה לך, הודעה זו נערכה.<br />";
$l['redirect_postedited_redirect'] = "אתה מועבר חזרה לאשכול.";
$l['redirect_postedited_poll'] = "תודה לך, הודעה זו נערכה. <br />בגלל שבחרת להוסיף סקר אתה מועבר כעת לדף יצירת סקר.";
$l['error_invalidpost'] = "מצטערים, הגעת לכתובת לא חוקית. תהיה בטוח שההודעה שצוינה קיימת ונסה שוב.";
$l['redirect_threaddeleted'] = "תודה לך, האשכול נמחק.<br />אתה מועבר כעת אל הפורום.";
$l['redirect_postdeleted'] = "תודה לך, ההודעה נמחקה.<br />אתה מועבר כעת לאשכול.";
$l['redirect_threadclosed'] = "אתה לא יכול לערוך הודעות קיימות באשכול זה מכיוון שהוא ננעל על ידי מנהל.";
$l['redirect_post_moderation'] = "מנהל הפורום קבע שכל ההודעות שנערכות יצטרכו אישור מנהל. אתה מועבר כעת חזרה לאשכול.";
$l['redirect_thread_moderation'] = "מנהל הפורום קבע שכל האשכולות שנערכים יצטרכו אישור מנהל. אתה מועבר כעת חזרה לפורום.";
$l['thread_deleted'] = "אשכול שנמחק";
$l['post_deleted'] = "הודעה שנמחקה";
?>